WS-I/BP1.2/Messages/ComplexDataTypes/XmlFormatter/DocLitW/SoapWsdl.ComplexDataTypes.XmlFormatter.DocLitWrapped_RetArrayString1D_Client_Request-4.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IComplexDataTypesDocLitW/RetArrayString1D</a:Action>
    <a:MessageID>urn:uuid:ebbd7e56-2741-4f17-a8de-7fee3db4cd4a</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetArrayString1D xmlns="http://tempuri.org/">
      <inArrayString1D xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 1</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 3</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 5</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 7</string>
        <string i:nil="true" xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
        <string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">string Array Data 9</string>
      </inArrayString1D>
    </RetArrayString1D>
  </s:Body>
</s:Envelope>