WS-I/BP1.2/Messages/ComplexDataTypes/XmlFormatter/DocLitW/SoapWsdl.ComplexDataTypes.XmlFormatter.DocLitWrapped_RetArrayInt1D_Client_Request-3.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IComplexDataTypesDocLitW/RetArrayInt1D</a:Action>
    <a:MessageID>urn:uuid:93cb433f-db8d-4d3e-97d8-5a3835adceca</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetArrayInt1D xmlns="http://tempuri.org/">
      <inArrayInt1D>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">2147483647</int>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">-2147483648</int>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">0</int>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">1</int>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">-1</int>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">50</int>
        <int xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">-50</int>
      </inArrayInt1D>
    </RetArrayInt1D>
  </s:Body>
</s:Envelope>